if OS.mac?
    # taps
    tap "homebrew/cask-fonts"
    tap "jandedobbeleer/oh-my-posh"

    brew "noti" # utility to display notifications from scripts
    brew "trash" # rm, but put in the trash rather than completely delete
    brew "oh-my-posh" # prompt theme engine

    # Applications
    cask "kitty" # a better terminal emulator

    brew "zsh" # install zsh from brew
    brew "git" # Git version control (latest version)


    # Fonts (Nerd Font versions include powerline glyphs)
    cask "font-jetbrains-mono-nerd-font"
    cask "font-caskaydia-mono-nerd-font"
    cask "font-iosevka-nerd-font"
    cask "font-fira-code-nerd-font"
    cask "font-maple-mono-nf"
    
elsif OS.linux?
    brew "xclip" # access to clipboard (similar to pbcopy/pbpaste)
end


# packages
brew "bat" # better cat
brew "cloc" # lines of code counter
brew "git-delta" # a better git diff
brew "entr" # file watcher / command runner
brew "eza" # modern ls replacement (formerly exa)
brew "fd" # find alternative
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "gh" # GitHub CLI
brew "gnupg" # GPG
brew "grep" # grep (latest)
brew "highlight" # code syntax highlighting
brew "htop" # a top alternative
brew "jq" # work with JSON files in shell scripts
brew "neofetch" # pretty system info
brew "neovim" # A better vim
brew "python" # python (latst)
brew "ripgrep" # very fast file searcher
brew "fnm" # Fast Node version manager
brew "shellcheck" # diagnostics for shell sripts
brew "tmux" # terminal multiplexer
brew "tree" # pretty-print directory contents
brew "wdiff" # word differences in text files
brew "wget" # internet file retriever
brew "z" # switch between most used directories

